{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3.1\n",
    "На вход программе последовательно подаются ненулевые целые числа (каждое число в новой строке). Ввод чисел заканчивается при вводе 0. Необходимо определить сумму всех положительных и сумму всех отрицательных введённых элементов. Программа должна вывести два значения - сумму положительных (на первом месте) и сумму отрицательных элементов (на втором месте) через запятую. Если сразу был введён ноль, то обе суммы равны нулю."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17,-22\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "sumn1 = 0\n",
    "sumn2 = 0\n",
    "while n != 0:\n",
    "    if n > 0:\n",
    "        sumn1 += n\n",
    "    if n < 0:\n",
    "        sumn2 += n\n",
    "    n = int(input()) \n",
    "print(f\"{sumn1},{sumn2}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3.2 \n",
    "Алина работает администратором в спортивном зале. В спортзал ежедневно приходит некоторое количество посетителей, N. Алине поручили вести статистику и в конце каждого рабочего дня определять возраста самого молодого и самого старшего из посетителей. Чтобы Алина не выполняла данную задачу вручную, необходимо написать программу, которая сделает за неё эту работу.\n",
    "\n",
    "На вход программе подаётся строка, содержащая N+1 число, из которых первое число - это количество посетителей NN спортзала за день, а последующие числа - это возраста посетителей. Числа задаются через пробел.\n",
    "\n",
    "Основываясь на входной информации, программа должна определить (не используя специальные встроенные функции языка программирования) возраста самого молодого и самого старшего посетителей и вывести их в порядке возрастания, разделив пробелом. Если посетителей не было (количество посетителей равно нулю), то вывести нулевые значения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15 46\n"
     ]
    }
   ],
   "source": [
    "N = list(map(int, input().split()))\n",
    "if N[0] > 0:\n",
    "    maxN = N[1]\n",
    "    minN = N[1]\n",
    "    for i in range(1, len(N)):\n",
    "        if N[i] > maxN:\n",
    "            maxN = N[i]\n",
    "        elif N[i] < minN:\n",
    "            minN = N[i]\n",
    "    print(minN, maxN)\n",
    "else: \n",
    "    print(0, 0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3.3\n",
    "В клинике «Семейная клиника» проводится акция на УЗИ беременных женщин. Стажёру Анне поручено позвонить всем беременным женщинам, наблюдающимся в клинике, и сообщить об акции. Так как число пациентов клиники NN может быть очень большим, необходимо помочь Анне автоматизировать процесс выбора беременных женщин среди всех пациентов.\n",
    "\n",
    "На вход программе подаются следующие входные данные: в первой строке - число N всех пациентов клиники, далее идёт ровно N строк, содержащих следующую информацию через пробел - порядковый номер пациента (1, 2, 3,...), его пол (M - мужчины, F - женщины) и наличие беременности (1 - беременна, 0 - не беременна).\n",
    "\n",
    "Программа должна вывести через запятую порядковые номера всех беременных женщин. Если беременных нет, то вывести 0."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1,5\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "res = []\n",
    "for i in range(n):\n",
    "    lst = list(input().split())\n",
    "    if lst[1] == \"F\" and lst[2] == \"1\":\n",
    "        res.append(lst[0])\n",
    "if len(res) == 0:\n",
    "    print(\"0\")\n",
    "else:\n",
    "    print(*res, sep=\",\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3.4\n",
    "Хорошо известно, что в производственной лаборатории должны контролироваться температура и относительная влажность воздуха. Для измерения климатических параметров лаборатории часто используются термогигрометры, а результаты измерений заносятся в специальный журнал. Обычно температура в лаборатории колеблется от 15 до 27 градусов, а влажность воздуха изменяется от 15 до 75 процентов. Необходимо на основании всех сделанных за день записей определить среднесуточную температуру и среднесуточную влажность воздуха в лаборатории. В течение каждого дня может быть сделано разное количество записей, но всегда есть хотя бы одна запись температуры и хотя бы одна запись влажности.\n",
    "\n",
    "На вход программе через пробел подаются зарегистрированные записи климатических измерений. Пример записи температуры: t=21C, влажности: h=52%. Все значения температур и влажностей заранее округлены до целых значений.\n",
    "\n",
    "Необходимо вычислить среднесуточную температуру N и среднесуточную влажность воздуха M и вывести результат в формате T=N;H=M (без пробелов)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "T=19.40;H=57.00\n"
     ]
    }
   ],
   "source": [
    "lst = list(input().split(\" \"))\n",
    "temp = []\n",
    "hum = []\n",
    "for elem in lst:\n",
    "    if \"t\" in elem:\n",
    "        temp.append(int(elem[2:4]))\n",
    "    elif \"h\" in elem:\n",
    "        hum.append(int(elem[2:4]))\n",
    "print(f\"T={sum(temp)/len(temp):.2f};H={sum(hum)/len(hum):.2f}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3.5\n",
    "Напишите программу, реализующую алгоритм перевода целого положительного числа N из двоичной системы счисления в десятичную.\n",
    "\n",
    "На вход программе подаётся число NN, представленное в двоичной системе счисления.\n",
    "\n",
    "Программа должна вывести число NN, представленное в десятичной системе счисления."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "226\n"
     ]
    }
   ],
   "source": [
    "n = input()\n",
    "l = len(n)\n",
    "res = 0\n",
    "for i in range(l):\n",
    "    res += int(n[i]) * 2 ** (l - i - 1)\n",
    "print(res)"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "ac59ebe37160ed0dfa835113d9b8498d9f09ceb179beaac4002f036b9467c963"
  },
  "kernelspec": {
   "display_name": "Python 3.9.10 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.10"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
