{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "92653da8",
   "metadata": {},
   "source": [
    "# 4.1\n",
    "\n",
    "Одна из цепочек молекулы ДНК имеет порядок нуклеотидов, записанный в строке S, которая подаётся на вход программе.\n",
    "\n",
    "Необходимо вывести на экран порядок нуклеотидов в комплементарной цепочке ДНК."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "973553b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "AATTGCGC\n",
      "TTAACGCG\n"
     ]
    }
   ],
   "source": [
    "def complementary_seq(seq):\n",
    "    mapped_nucl = {\"A\":\"T\", \"T\":\"A\", \"G\":\"C\", \"C\":\"G\"}\n",
    "    comp_seq = \"\"\n",
    "    for nucl in seq:\n",
    "        comp_seq += mapped_nucl[nucl]\n",
    "    return comp_seq\n",
    "\n",
    "dna = input()\n",
    "print(complementary_seq(dna))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0db7c354",
   "metadata": {},
   "source": [
    "# 4.2\n",
    "Необходимо определить, является ли введённая строка палиндромом. Вывести yes, если является, и no в противном случае."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a6c331d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "101\n",
      "yes\n"
     ]
    }
   ],
   "source": [
    "s = input()\n",
    "if s == s[::-1]:\n",
    "    print(\"yes\")\n",
    "else:\n",
    "    print(\"no\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e079c414",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "abcdabcd\n",
      "no\n"
     ]
    }
   ],
   "source": [
    "s = input()\n",
    "flag = True\n",
    "for i in range(len(s) // 2):\n",
    "    if s[i] != s[len(s) - 1 - i]:\n",
    "        flag = False\n",
    "        break\n",
    "if flag:\n",
    "    print(\"yes\")\n",
    "else:\n",
    "    print(\"no\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe696406",
   "metadata": {},
   "source": [
    "# 4.3\n",
    "Необходимо вычислить расстояние Хэмминга для двух нуклеотидных последовательностей.\n",
    "\n",
    "Входные данные: две строки, в каждой из которых записана последовательность нуклеотидов одинаковой длины.\n",
    "\n",
    "Выходные данные: расстояние Хэмминга.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9ba52c34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CCAGAGAC\n",
      "CCAAGGCT\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "s1 = input()\n",
    "s2 = input()\n",
    "dist_h = 0\n",
    "if len(s1) == len(s2):\n",
    "    for i in range(len(s1)):\n",
    "        if s1[i] != s2[i]:\n",
    "            dist_h += 1\n",
    "    print(dist_h)\n",
    "else:\n",
    "    print(\"ошибка\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6f035569",
   "metadata": {},
   "source": [
    "# 4.4\n",
    "На вход программе подаётся фрагмент нуклеотидной последовательности молекулы ДНК. Необходимо определить нуклеотидную последовательность второй цепи и общее число водородных связей, которые образуются между двумя цепями ДНК. \n",
    "\n",
    "Программа должна вывести число водородных связей."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "df665ccc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "AAGTGACGGATTAA\n",
      "33\n"
     ]
    }
   ],
   "source": [
    "dna = input()\n",
    "dict_dna = {\"A\":\"T\", \"T\":\"A\", \"G\":\"C\", \"C\":\"G\"}\n",
    "dna_new = \"\"\n",
    "h_bonds = 0\n",
    "for nucl in dna:\n",
    "    dna_new += dict_dna[nucl]\n",
    "    if nucl == \"A\" or nucl == \"T\":\n",
    "        h_bonds += 2\n",
    "    elif nucl == \"C\" or nucl == \"G\":\n",
    "        h_bonds += 3\n",
    "print(h_bonds)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "965031cf",
   "metadata": {},
   "source": [
    "# 4.5\n",
    "Одно секретное предприятие для переписки между сотрудниками придумало специальный шифр. Каждая буква зашифрованного слова после её встречи в тексте может несколько раз (или ни разу) повторяться в случайных местах слова, однако, символ \";\" указывает на то, что повторения всех предыдущих букв дальше не будет. Символ \";\" может встречаться неопределённое количество раз в начале, в конце или внутри слова. В слове могут встречаться только буквы русского алфавита и символ \";\".\n",
    "\n",
    "Например, по секретному каналу было передано слово сююссрюсрсссрпрю;ррририззиррз. Как его расшифровать? Буква с встречается впервые, значит, она является первой буквой искомого слова; буква ю так же встречается впервые, поэтому является второй буквой искомого слова; буквы юсс являются повторениями равнее встреченных букв с и ю, поэтому они игнорируются; буква р встречается впервые и добавляется к искомому слову; последующие буквы юсрссср являются повторениями ранее встречающихся букв, поэтому игнорируются; буква п встречается впервые и добавляется к искомому слову; буквы рю игнорируются по понятным причинам. Далее появляется символ ; , который означает, что дальнейшее появление букв с, ю, р, п не будет расцениваться как повторения, и эти буквы вновь могут участвовать в словообразовании. После ; идёт буква р, которая добавляется к исходному слову, а вот уже дальнейшее появление буквы р будет расцениваться как повторение. Доводя процедуру декодировки до конца, получаем, что в искомом слове так же присутствуют буквы и, з, а само слово - сюрприз.\n",
    "\n",
    "Необходимо написать программу-декодировщик, на вход которой подаётся закодированное слово, а на выходе - изначальная запись слова. Слова задаются на русском языке строчными буквами.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "ec3827aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ппопопооололпууло;чичиилчлч;ооссьосьсоь\n",
      "получилось\n"
     ]
    }
   ],
   "source": [
    "s = input().split(\";\") # разделяем строку на слова, получаем список?\n",
    "m = []\n",
    "for fragment in s: # по слову в списке\n",
    "    filtered_s = \"\"\n",
    "    #получаем 1 фрагмент из зашифрованного слова\n",
    "    for ch in fragment: # по буквам в словах \n",
    "        if ch not in filtered_s:\n",
    "            filtered_s += ch # получили 1 символ \n",
    "    m.append(filtered_s)   \n",
    "print(\"\".join(m))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
